servicemix-wsnotification/src/test/resources/org/servicemix/ws/soap/unknownRequest.xml

<?xml version="1.0"?>
<s12:Envelope
        xmlns:s12='http://www.w3.org/2003/05/soap-envelope'
        xmlns:wsa='http://schemas.xmlsoap.org/ws/2004/08/addressing'
        xmlns:wse='http://schemas.xmlsoap.org/ws/2004/08/eventing'
        xmlns:ew='http://www.example.com/warnings'>
  <s12:Header>
    <wsa:Action>
      http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe
    </wsa:Action>
    <wsa:MessageID>
      uuid:d7c5726b-de29-4313-b4d4-b3425b200839
    </wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.example.com/MyEventSink</wsa:Address>
    </wsa:ReplyTo>
    <wsa:To>http://www.example.org/oceanwatch/EventSource</wsa:To>
  </s12:Header>
  <s12:Body>
    <foo:something xmlns:foo="uri:foo.something">
      <foo:brandNewSchema>This should not be known at runtime</foo:brandNewSchema>
    </foo:something>
  </s12:Body>
</s12:Envelope>